Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Likewise, any server may act as an origin server, proxy, gateway, or tunnel, switching behavior based on the nature of each request.
zh_cn: 同样，任何服务器都可以充当源服务器，代理，网关或隧道，基于每个请求的性质来切换行为。

source: Likewise, common HTTP origin servers include home automation units, configurable networking components, office machines, autonomous robots, news feeds, traffic cameras, ad selectors, and video-delivery platforms.
zh_cn: 同样，常见的 HTTP 源服务器包括家庭自动化单元，可配置网络组件，办公机器，自动机器人，新闻源，交通摄像头，广告选择器和视频传送平台。

source: Likewise, later requests might be sent through a different path of connections, often based on dynamic configuration for load balancing.
zh_cn: 同样，以后的请求可能通过不同的连接路径发送，通常基于负载平衡的动态配置。

source: Likewise, protocols and data formats that make use of URI references can refer to this specification as a definition for the range of syntax allowed for all URIs, including those schemes that have yet to be defined.
zh_cn: 同样，使用 URI 引用的协议和数据格式可以将此规范称为所有 URI 允许的语法范围的定义，包括那些尚未定义的方案。

source: Likewise, reasonable use of a safe method is not expected to cause any harm, loss of property, or unusual burden on the origin server.
zh_cn: 同样，合理使用安全方法预计不会对原始服务器造成任何伤害，财产损失或异常负担。

source: Likewise, requirements that an automated action be confirmed by the user before proceeding might be met via advance configuration choices, run-time options, or simple avoidance of the unsafe action; confirmation does not imply any specific user interface or interruption of normal processing if the user has already made that choice.
zh_cn: 同样，可以通过提前配置选择，运行时选项或简单避免不安全操作来满足用户在继续之前确认自动操作的要求；如果用户已经做出该选择，则确认不暗示任何特定用户界面或正常处理的中断。

source: Likewise, servers do not need to be aware of each client's purpose: an HTTP request can be considered in isolation rather than being associated with a specific type of client or a predetermined sequence of application steps.
zh_cn: 同样，服务器不需要知道每个客户端的目的：可以单独考虑 HTTP 请求，而不是与特定类型的客户端或预定的应用程序步骤序列相关联。

source: Likewise, the "one" resource identified might not be singular in nature (e.g., a resource might be a named set or a mapping that varies over time).
zh_cn: 同样，所识别的“一个”资源本质上可能不是单一的(例如，资源可能是命名集或随时间变化的映射)。

source: Likewise, the presence of such whitespace in a response might be ignored by some clients or cause others to cease parsing.
zh_cn: 同样，响应中存在这样的空格可能会被某些客户端忽略或导致其他客户端停止解析。

source: Line folding in chunk extensions is disallowed.
zh_cn: 不允许在块扩展中折叠行。

source: Linear white space (LWS) MUST NOT be used between the type and subtype, nor between an attribute and its value.
zh_cn: 线性空白(LWS)不能在类型和子类型之间使用，也不能在属性和它的值之间使用。

source: Location Headers and Spoofing
zh_cn: 位置首部和欺骗

source: Logically, there are always four connection states outstanding: the current read and write states, and the pending read and write states.
zh_cn: 逻辑上，总有四种未完成的连接状态：当前的读和写状态，以及挂起的读和写状态。

source: Looking to the right towards the subscriber/consumer, is called the **downstream**.
zh_cn: 向右侧的订阅者/消费者看，称为 **downstream**。

source: MD5 and SHA-1 have been proven to be insecure, subject to collision attacks.
zh_cn: MD5 和 SHA-1 已被证明是不安全的，容易受到碰撞攻击。

source: MHTML and Line Length Limitations
zh_cn: MHTML 和行长限制

source: MIME provides for a number of "multipart" types -- encapsulations of one or more entities within a single message-body.
zh_cn: MIME 提供了许多“multipart”类型 - 单个消息体内的一个或多个实体的封装。

source: Major Differences from TLS 1.1
zh_cn: 与 TLS 1.1 的主要区别

source: Major Differences from TLS 1.2
zh_cn: 与 TLS 1.2 的主要区别

source: Mandatory Cipher Suites
zh_cn: 强制密码套件

source: Many HTTP/1.1 header field values consist of words separated by LWS or special characters.
zh_cn: 许多 HTTP/1.1 首部字段值由 LWS 或特殊字符分隔的单词组成。

source: Many URI schemes include a hierarchical element for a naming authority so that governance of the name space defined by the remainder of the URI is delegated to that authority (which may, in turn, delegate it further).
zh_cn: 许多 URI 方案包括命名权限的分层元素，以便将由 URI 的其余部分定义的名称空间的治理委托给该权限(进而可以进一步委托它)。

source: Many connections can be instantiated using the same session through the resumption feature of the TLS Handshake Protocol.
zh_cn: 可以通过 TLS 握手协议的恢复功能使用相同的会话来实例化许多连接。

source: Many frequently used operator has overloads that can deal with the other types.
zh_cn: 许多经常使用的运算符具有可以处理其他类型的重载。

source: Many implementations depend on HTTP's stateless design in order to reuse proxied connections or dynamically load balance requests across multiple servers.
zh_cn: 许多实现依赖于 HTTP 的无状态设计，以便重用代理连接或跨多个服务器动态地负载平衡请求。

source: Many of the cryptographic computations in TLS make use of a transcript hash.
zh_cn: TLS 中的许多加密计算都使用了 transcript hash。

source: Many operators that expect the user to provide some function returning a reactive type can't be overloaded because the type erasure around a `Function<T, X>` turns such method signatures into duplicates.
zh_cn: 许多期望用户提供返回反应类型的函数的运算符不能被重载，因为围绕 `Function<T, X>` 的类型擦除将这样的方法签名变成重复的。

source: Many value generation can be expressed in a form of a state-machine.
zh_cn: 许多值生成可以以状态机的形式表达。

source: Matching is performed using the matching rules specified by [RFC2459].
zh_cn: 使用 [RFC2459] 指定的匹配规则执行匹配。

source: Mathematical and Aggregate Operators
zh_cn: 数学和集合操作符

source: Meaning of this message:
zh_cn: 此消息的含义：

source: Media Types
zh_cn: 媒体类型

source: Media-type values are registered with the Internet Assigned Number Authority (IANA [19]).
zh_cn: 媒体类型值已在 Internet Assigned Number Authority(IANA [19])中注册。

source: Message Body
zh_cn: 消息主体

source: Message Body Length
zh_cn: 消息主体长度

source: Message Confidentiality
zh_cn: 消息机密性

source: Message Format
zh_cn: 消息格式

source: Message Forwarding
zh_cn: 消息转发

source: Message Headers
zh_cn: 消息首部

source: Message Integrity
zh_cn: 消息完整性

source: Message Length
zh_cn: 消息长度

source: Message Parsing Robustness
zh_cn: 消息解析健状性

source: Message Routing
zh_cn: 消息路由

source: Message Transmission Requirements
zh_cn: 消息传输要求

source: Message Types
zh_cn: 消息类型

source: Message boundaries are handled differently depending on the underlying ContentType.
zh_cn: 根据底层 ContentType，消息边界的处理方式不同。

source: Message flow for a full handshake
zh_cn: 完整握手的消息流

source: Message flow for an abbreviated handshake
zh_cn: 简略握手的消息流

source: Message transport includes a message integrity check using a keyed MAC.
zh_cn: 消息传输包括使用加密 MAC 的消息完整性检查。

source: Messages MUST NOT include both a Content-Length header field and a non-identity transfer-coding.
zh_cn: 消息不能同时包含 Content-Length 首部字段和非标识传输编码。

source: Messages are parsed using a generic algorithm, independent of the individual header field names.
zh_cn: 使用通用算法解析消息，独立于各个首部字段名称。

source: Messages are passed in a format similar to that used by Internet mail [9] as defined by the Multipurpose Internet Mail Extensions (MIME) [7].
zh_cn: 消息的传递格式类似于多用途 Internet 邮件扩展(MIME)[7] 定义的 Internet 邮件 [9] 所使用的格式。

source: Messages are passed in a format similar to that used by Internet mail [RFC5322] and the Multipurpose Internet Mail Extensions (MIME) [RFC2045] (see Appendix A of [RFC7231] for the differences between HTTP and MIME messages).
zh_cn: 消息的传递格式类似于互联网邮件 [RFC5322] 和多用途互联网邮件扩展(MIME)[RFC2045] 所使用的格式(有关 HTTP 和 MIME 邮件之间的差异，请参阅 [RFC7231] 的附录 A)。

source: Messages is the concatenation of the indicated handshake messages, including the handshake message type and length fields, but not including record layer headers.
zh_cn: Messages 是指示的握手消息的串联，包括握手消息类型和长度字段，但不包括记录层首部。

source: Method
zh_cn: 方法

source: Method Definitions
zh_cn: 方法定义

source: Method Registry
zh_cn: 方法注册

source: Methods can also have the property of "idempotence" in that (aside from error or expiration issues) the side-effects of N > 0 identical requests is the same as for a single request.
zh_cn: 方法也可以具有“幂等”的属性(除了错误或到期问题) N>0 个相同请求的副作用与单个请求相同。

source: Minimum supported sizes for various protocol elements have been suggested, to improve interoperability.
zh_cn: 已提出各种协议元素的最小支持大小，以提高互操作性。

source: Minor 2.x increments (such as 2.1, 2.2, etc) will occur when non-trivial new functionality is added or significant enhancements or bug fixes occur that may have behavioral changes that may affect some edge cases (such as dependence on behavior resulting from a bug).
zh_cn: 当添加非平凡的新功能或重大增强或发生可能影响某些边缘情况的行为变化（例如，对错误导致的行为的依赖）的错误修复时，将发生次要 2.x 升级（例如 2.1,2.2 等）。

source: Miscellaneous
zh_cn: 杂项

source: Missing Charset
zh_cn: 丢失的字符集

source: Model of Operation
zh_cn: 操作模式

source: Monitoring Connections for Error Status Messages
zh_cn: 监视错误状态消息的连接

source: More specifically, it provides a `Scheduler` that schedules on the main thread or any given `Looper`.
zh_cn: 更具体地说，它提供了一个 `Scheduler`，它在主线程或任何给定的 `Looper` 上进行调度。

source: More than one response message per request only occurs when one or more informational responses (1xx, see Section 6.2 of [RFC7231]) precede a final response to the same request.
zh_cn: 当一个或多个信息响应(1xx，参见 [RFC7231] 的第 6.2 节)在对同一请求的最终响应之前时，每个请求只发生一条响应消息。

source: Most HTTP communication consists of a retrieval request (GET) for a representation of some resource identified by a URI.
zh_cn: 大多数 HTTP 通信包括用于表示由 URI 标识的某些资源的检索请求(GET)。

source: Most HTTP communication is initiated by a user agent and consists of a request to be applied to a resource on some origin server.
zh_cn: 大多数 HTTP 通信由用户代理启动，并且包含要应用于某个源服务器上的资源的请求。

source: Most HTTP header field values are defined using common syntax components (token, quoted-string, and comment) separated by whitespace or specific delimiting characters.
zh_cn: 大多数 HTTP 首部字段值是使用由空格或特定分隔字符分隔的通用语法组件(标记，引用字符串和注释)定义的。

source: Most asynchronous operator use this as their default `Scheduler`.
zh_cn: 大多数异步操作符使用它作为它们的默认 `Scheduler`。

source: Most backpressure-sensitive operators in the recent versions of RxJava now allow programmers to specify the size of their internal buffers.
zh_cn: 最近版本的 RxJava 中的大多数背压敏感操作符现在允许程序员指定其内部缓冲区的大小。

source: Most clients maintain multiple connections in parallel, including more than one connection per server endpoint.
zh_cn: 大多数客户端并行维护多个连接，包括每个服务器端点多个连接。

source: Most current TLS extensions are relevant only when a session is initiated: when an older session is resumed, the server does not process these extensions in Client Hello, and does not include them in Server Hello.
zh_cn: 大多数当前的 TLS 扩展仅在启动会话时才相关：当恢复较旧的会话时，服务器不会在 Client Hello 中处理这些扩展，也不会将它们包含在 Server Hello 中。

source: Most developers encounter backpressure when their application fails with `MissingBackpressureException` and the exception usually points to the `observeOn` operator.
zh_cn: 大多数开发人员在应用程序因 `MissingBackpressureException` 而失败时都会遇到背压，而该异常通常指向 `observeOn` 操作符。

source: Most fields using product tokens also allow sub-products which form a significant part of the application to be listed, separated by white space.
zh_cn: 使用产品标记的大多数字段还允许列出构成应用程序重要部分的子产品，由空格分隔。

source: Most operators are still there in 2.x and practically all of them have the same behavior as they had in 1.x.
zh_cn: 大多数操作符仍然在 2.x 中，并且几乎所有操作符都具有与 1.x 中相同的行为。

source: Most operators operate on an Observable and return an Observable.
zh_cn: 大多数操作符都在 Observable 上操作并返回一个 Observable。

source: Most servers are designed to maintain thousands of concurrent connections, while controlling request queues to enable fair use and detect denial-of-service attacks.
zh_cn: 大多数服务器旨在维护数千个并发连接，同时控制请求队列以实现合理使用并检测拒绝服务攻击。

source: Motivation
zh_cn: 动机

source: Much of its functionality is superseded by supported_signature_algorithms.
zh_cn: 它的大部分功能都被 supported_signature_algorithms 取代。

source: Much of that architecture is reflected in the terminology and syntax productions used to define HTTP.
zh_cn: 大部分体系结构都反映在用于定义 HTTP 的术语和语法产品中。

source: Multiple byte data items are concatenations of bytes, from left to right, from top to bottom.
zh_cn: 多字节数据项是从左到右，从上到下的字节串联。

source: Multiple connections are typically used to avoid the "head-of-line blocking" problem, wherein a request that takes significant server-side processing and/or has a large payload blocks subsequent requests on the same connection.
zh_cn: 通常使用多个连接来避免“行头阻塞”问题，其中进行大量服务器端处理和/或具有大的有效载荷的请求阻止对同一连接的后续请求。

source: Multiple message-header fields with the same field-name MAY be present in a message if and only if the entire field-value for that header field is defined as a comma-separated list [i.e., #(values)].
zh_cn: 当且仅当该首部字段的整个字段值被定义为以逗号分隔的列表 [ 即，#(values)] 时，具有相同字段名的多个消息首部字段可以存在于消息中。

source: Multiple-byte data items are concatenations of bytes, from left to right, from top to bottom.
zh_cn: 多字节数据项是从左到右，从上到下的字节串联。

source: Must be zero.
zh_cn: 必须为零。

source: NIST formally deprecated use of SHA-1 in 2011 [NISTSP800-131A-R2] and disallowed its use for digital signatures at the end of 2013, based on both the Wang, et.
zh_cn: NIST 在 2011 年正式弃用 SHA-1 [NISTSP800-131A-R2]，并且在 2013 年底不允许将其用于数字签名，

source: NOTE 1 – This restriction is introduced for possible future extension.
zh_cn: 注 1 - 引入此限制以便将来可能的扩展。

source: NOTE 2 – In the long form, it is a sender's option whether to use more length octets than the minimum necessary.
zh_cn: 注 2 - 在长形式中，发送者可以选择是否使用比最小必要值更长的八位字节。

source: NOTE BENE: this diagram is only a summary and must not be taken as the total specification.
zh_cn: 注：此图只是一个概要，不能作为总规范。

source: NOTE – Subsequent subclauses specify whether the encoding is primitive or constructed for each type.
zh_cn: 注 - 后续子条款为每种类型指定编码是原始的还是为结构的。

source: NOTE – The short form can only be used if the number of octets in the contents octets is less than or equal to 127.
zh_cn: 注 - 只有当内容八位字节中的八位字节数小于或等于 127 时，才能使用短格式。

source: Naming in programming is one of the hardest things as names are expected to be not long, expressive, capturing and easily memorable.
zh_cn: 编程中的命名是最困难的事情之一，因为名称不宜太长，表达清楚，容易捕捉且容易记忆。

source: Naturally, `fromCallable` also properly supports backpressure and won't emit the computed value unless requested.
zh_cn: 当然，`fromCallable` 也能正确支持背压，除非有要求，否则不会发射计算值。

source: Naturally, it is not possible to ensure that the server does not generate side-effects as a result of performing a GET request; in fact, some dynamic resources consider that a feature.
zh_cn: 当然，不可能确保服务器不会因执行 GET 请求而产生副作用；实际上，一些动态资源会考虑这个功能。

source: Negotiation
zh_cn: 协商

source: Network intermediaries are indistinguishable (at a protocol level) from a man-in-the-middle attack, often introducing security flaws or interoperability problems due to mistakenly violating HTTP semantics.
zh_cn: 网络中介与中间人攻击无法区分(在协议级别)，由于错误地违反 HTTP 语义而经常引入安全漏洞或互操作性问题。

source: Nevertheless, nothing in this specification prevents an application from limiting itself to particular types of resources, or to a subset of URIs that maintains characteristics desired by that application.
zh_cn: 然而，本说明书中没有任何内容阻止应用程序将其自身限制于特定类型的资源，或者限制维护该应用程序所需特性的 URI 的子集。

source: New Alert values are assigned by IANA as described in Section 12.
zh_cn: 新警报值由 IANA 分配，如第 12 节所述。

source: New ClientCertificateType values are assigned by IANA as described in Section 12.
zh_cn: 新的 ClientCertificateType 值由 IANA 分配，如第 12 节所述。

source: New cipher suites MUST explicitly specify a PRF and, in general, SHOULD use the TLS PRF with SHA-256 or a stronger standard hash function.
zh_cn: 新的密码套件必须明确指定 PRF，并且通常应该使用带有 SHA-256 的 TLS PRF 或更强的标准散列函数。

source: New content-coding value tokens SHOULD be registered; to allow interoperability between clients and servers, specifications of the content coding algorithms needed to implement a new value SHOULD be publicly available and adequate for independent implementation, and conform to the purpose of content coding defined in this section.
zh_cn: 新的内容编码值标记应该注册；为了实现客户端和服务器之间的互操作性，实现新值所需的内容编码算法的规范应该是公开可用的，并且足以独立实现，并且符合本节中定义的内容编码的目的。

source: New functionality marked with an [`@Beta`][beta source link] or [`@Experimental`][experimental source link] annotation can also be added in patch releases to allow rapid exploration and iteration of unstable new functionality.
zh_cn: 标记有 [`@Beta`][beta source link] 或 [`@Experimental`][experimental source link] 注释的新功能也可以添加到补丁版本中，以便快速探索和迭代不稳定的新功能。

source: New handshake message types are assigned by IANA as described in Section 11.
zh_cn: 新的握手消息类型由 IANA 分配，如第 11 节所述。

source: New handshake message types are assigned by IANA as described in Section 12.
zh_cn: 新的握手消息类型由 IANA 分配，如第 12 节所述。

source: New header fields can be defined such that, when they are understood by a recipient, they might override or enhance the interpretation of previously defined header fields, define preconditions on request evaluation, or refine the meaning of responses.
zh_cn: 可以定义新的首部字段，使得当接收者理解它们时，它们可以覆盖或增强对先前定义的首部字段的解释，定义请求评估的前提条件，或者细化响应的含义。

source: New header fields can be introduced without changing the protocol version if their defined semantics allow them to be safely ignored by recipients that do not recognize them.
zh_cn: 如果定义的语义允许它们被不识别它们的接收者安全地忽略，则可以在不更改协议版本的情况下引入新的首部字段。

source: New instances of a connection will be referred to as incarnations of the connection.
zh_cn: 连接的新实例将被称为连接的化身。

source: New key exchange methods can be created by specifying a format for these messages and by defining the use of the messages to allow the client and server to agree upon a shared secret.
zh_cn: 可以通过指定这些消息的格式并定义消息的使用来创建新的密钥交换方法，以允许客户端和服务器就共享密钥达成一致。

source: New record content type values are assigned by IANA in the TLS Content Type Registry as described in Section 12.
zh_cn: IANA 在 TLS 内容类型注册表中分配新记录内容类型值，如第 12 节所述。

source: New record content type values are assigned by IANA in the TLS ContentType registry as described in Section 11.
zh_cn: 新记录内容类型值由 IANA 在 TLS ContentType 注册表中分配，如第 11 节中所述。

source: New return type
zh_cn: 新返回类型

source: New transfer-coding value tokens SHOULD be registered in the same way as new content-coding value tokens (section 3.5).
zh_cn: 新的传输编码值标记应该以与新的内容编码值标记相同的方式注册(第 3.5 节)。

source: Newly defined header fields SHOULD limit their field values to US-ASCII octets.
zh_cn: 新定义的首部字段应该将其字段值限制为 US-ASCII 八位字节。

source: Next is a “decision tree” that may help you choose the operator that is most appropriate to your use case.
zh_cn: 接下来是一个“决策树”，可以帮助您选择最适合您的用例的操作符。

source: Next, the server will send the ServerHelloDone message, indicating that the hello-message phase of the handshake is complete.
zh_cn: 接下来，服务器将发送 ServerHelloDone 消息，指示握手的 hello-message 阶段已完成。

source: No CR or LF is allowed except in the final CRLF sequence.
zh_cn: 除最终的 CRLF 序列外，不允许使用 CR 或 LF。

source: No Content-Transfer-Encoding
zh_cn: 无内容传输编码

source: No MAC key is used.
zh_cn: 没有使用 MAC 密钥。

source: No change is made to the version number for the addition of message components which do not affect communication behavior or which only add to extensible field values.
zh_cn: 添加不影响通信行为或仅添加到可扩展字段值的消息组件的版本号没有变化。

source: No fields of a multi-element structure or vector may be elided.
zh_cn: 不能省略多元素结构或 vector 的字段。

source: No further SENDs from the user will be accepted by the TCP, and it enters the FIN-WAIT-1 state.
zh_cn: TCP 不接受用户的进一步 SEND，并进入 FIN-WAIT-1 状态。

source: No further development, support, maintenance, PRs and updates will happen.
zh_cn: 不会进一步开发，支持，维护，PR 和更新。

source: No longer wraps all consumer types (i.e., `Observer`) with a safety wrapper, (just like the 1.x `unsafeSubscribe` no longer available).
zh_cn: 不再用安全包装器包装所有消费者类型(即 `Observer`)(就像 1.x 中的 `unsafeSubscribe` 不再可用)。

source: No part of this standard should be taken to dictate the manner in which a usage profile for TLS manages its data transport, including when connections are opened or closed.
zh_cn: 不应采用此标准的任何部分来规定 TLS 的使用配置文件管理其数据传输的方式，包括何时打开或关闭连接。

source: No variants of the Bleichenbacher attack are known to exist provided that the above recommendations are followed.
zh_cn: 如果遵循上述建议，则不存在 Bleichenbacher 攻击的变体。

source: No whitespace is allowed between the header field-name and colon.
zh_cn: 首部字段名称和冒号之间不允许有空格。

source: Non-ASCII characters must first be encoded according to UTF-8 [STD63], and then each octet of the corresponding UTF-8 sequence must be percent-encoded to be represented as URI characters.
zh_cn: 非 ASCII 字符必须首先根据 UTF-8[std63] 进行编码，然后相应的 UTF-8 序列的每个八位字节必须进行百分比编码，以表示为 URI 字符。

source: Non-US-ASCII content in header fields and the reason phrase has been obsoleted and made opaque (the TEXT rule was removed).
zh_cn: 首部字段中的非 US-ASCII 内容和原因短语已被废弃并变为不透明(删除了 TEXT 规则)。

source: Non-idempotent methods or sequences MUST NOT be automatically retried, although user agents MAY offer a human operator the choice of retrying the request(s).
zh_cn: 非幂等方法或序列不得自动重试，尽管用户代理可以为人类操作符提供重试请求的选择。

source: Non-modifiable Headers
zh_cn: 不可修改的首部

source: Non-validating Conditionals
zh_cn: 非验证条件

source: Non-validating parsers (those that merely separate a URI reference into its major components) will often ignore the subcomponent structure of authority, treating it as an opaque string from the double-slash to the first terminating delimiter, until such time as the URI is dereferenced.
zh_cn: 非验证解析器(仅将 URI 引用分隔到其主要组件中的解析器)通常会忽略权限的子组件结构，将其视为从双斜杠到第一个终止分隔符的不透明字符串，直到取消对 URI 的引用为止。

source: Nonetheless, "server-oriented" extensions may be provided in the future within this framework.
zh_cn: 尽管如此，未来可能会在此框架内提供“面向服务器”的扩展。

source: Nor should it be assumed that a system using URIs will access the resource identified: in many cases, URIs are used to denote resources without any intention that they be accessed.
zh_cn: 也不应该假设使用 URI 的系统将访问所识别的资源：在许多情况下，URI 用于表示资源而无意访问它们。

source: Normal Close Sequence
zh_cn: 正常关闭序列

source: Normal HTTP behavior, including retained connections should be followed.
zh_cn: 应遵循正常的 HTTP 行为，包括持久连接。

source: Normalization and Comparison
zh_cn: 规范化和比较

source: Normalization may increase the set of same-document references, which may be of benefit to some caching applications.
zh_cn: 规范化可能会增加同一文档引用的集合，这可能对某些缓存应用程序有益。

source: Normalization of the base and target URIs prior to their comparison, as described in Sections 6.2.2 and 6.2.3, is allowed but rarely performed in practice.
zh_cn: 如第 6.2.2 和 6.2.3 节所述，在比较之前对基本 URI 和目标 URI 进行标准化是允许的，但在实践中很少执行。

source: Normative References
zh_cn: 规范性参考文献

source: Not all of these are available in all implementations, and some implementations use other naming conventions (for example, in RxScala, what is called a “PublishSubject” here is known simply as a “Subject”):
zh_cn: 并非所有这些种类都在所有实现中可用，并且一些实现使用其他命名约定(例如，在 RxScala 中，在这里简称为“Subject”的被称为的“PublishSubject”)：

source: Not all resources are network "retrievable"; e.g., human beings, corporations, and bound books in a library can also be considered resources.
zh_cn: 并非所有资源都是网络“可检索的”;例如，人，公司和图书馆中的装订书籍也可以被视为资源。

source: Not all responses are usefully cacheable, and some requests may contain modifiers which place special requirements on cache behavior.
zh_cn: 并非所有响应都可以缓存，并且某些请求可能包含对缓存行为提出特殊要求的修饰符。

source: Notational Conventions and Generic Grammar
zh_cn: 符号约定和通用语法

source: Note also that due to Reactive-Streams compatibility, the method `onCompleted` has been renamed to `onComplete` without the trailing `d`.
zh_cn: 另请注意，由于 Reactive-Streams 兼容性，方法 `onCompleted` 已重命名为 `onComplete` 而没有尾随的 `d`。

source: Note also the `Files.readLines(name)` invoked without try-catch.
zh_cn: 另请注意，在没有 try-catch 的情况下调用 `Files.readLines(name)`。

source: Note hovewer that these operators only reduce the rate of value reception by the downstream and thus they may still lead to `MissingBackpressureException`.
zh_cn: 但请注意，这些操作符仅降低了下游的值接收速率，因此它们仍可能导致 `MissingBackpressureException`。

source: Note however that `onBackpressureBuffer` consumes its source in an unbounded manner, that is, without applying any backpressure to it.
zh_cn: 但请注意，`onBackpressureBuffer` 以无限制的方式消耗其来源，即不对其施加任何背压。

source: Note however that generally, this may be only a temporary fix as the overflow can still happen if the source overproduces the predicted buffer size.
zh_cn: 但请注意，通常情况下，这可能只是一个临时修复，因为如果源过量生产超出预测的缓冲区大小，仍可能发生溢出。

source: Note however that the computation does happen anyway.
zh_cn: 但请注意，无论如何计算确实会发生。

source: Note in particular that type and length of a record are not protected by encryption.
zh_cn: 请特别注意，记录的类型和长度不受加密保护。
